ec2-galera/old/galera-standalone/add_2_240.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            35098
        write:                           12535
        other:                           5014
        total:                           52647
    transactions:                        2507   (10.45 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 47633  (198.46 per sec.)
    other operations:                    5014   (20.89 per sec.)

Test execution summary:
    total time:                          240.0146s
    total number of events:              2507
    total time taken by event execution: 479.9952
    per-request statistics:
         min:                                 15.53ms
         avg:                                191.46ms
         max:                                725.75ms
         approx.  95 percentile:             341.01ms

Threads fairness:
    events (avg/stddev):           1253.5000/0.50
    execution time (avg/stddev):   239.9976/0.00